---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicApplication
source: html/2dd327d1-6c97-d61e-754f-bb8e18a70f10.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicApplication Property

The property labeled "Finish" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicApplicationType".